app/controllers/devise/registrations_controller.rb

INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at", "email", "encrypted_password", "department_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save