app/services/mystery_lunch/create.rb

    def new_group
      Group.create
---
INSERT INTO "groups" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-09-04 13:05:37.398616"], ["updated_at", "2022-09-04 13:05:37.398616"]]

    def skip_groups
      LunchGroup.current_month.where(user_id: not_group_users_ids).pluck(:group_id)
---
SELECT "lunch_groups"."group_id" FROM "lunch_groups" WHERE (DATE(created_at) BETWEEN '2022-09-01' AND '2022-09-30') AND "lunch_groups"."user_id" IN ($1, $2)  [["user_id", 94], ["user_id", 96]]

    def available_group
      Group.joins('left join lunch_groups on groups.id = lunch_groups.group_id')
           .where("DATE(groups.created_at) BETWEEN ? AND ?", Date.today.beginning_of_month, Date.today.end_of_month)
           .where.not(id: skip_groups)
           .group('groups.id')
---
INSERT INTO "lunch_groups" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 31], ["group_id", 127], ["created_at", "2022-09-01 15:15:21.564054"], ["updated_at", "2022-09-01 15:15:21.564054"]]
SELECT "groups".* FROM "groups" left join lunch_groups on groups.id = lunch_groups.group_id WHERE (DATE(groups.created_at) BETWEEN '2022-09-01' AND '2022-09-30') AND 1=1 GROUP BY groups.id HAVING (count(groups.id) < 3 ) ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def create_mystery_lunch
      group.lunch_groups.create(user_id: user.id)
---
INSERT INTO "lunch_groups" ("user_id", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 87], ["group_id", 257], ["created_at", "2022-09-04 13:05:37.408063"], ["updated_at", "2022-09-04 13:05:37.408063"]]

    def group_ids
      LunchGroup.where(user_id: user.id)
                .where("DATE(created_at) BETWEEN ? AND ?", (Date.today.beginning_of_month - 3.months), (Date.today.beginning_of_month - 1.day))
                .pluck(:group_id)
---
SELECT "lunch_groups"."group_id" FROM "lunch_groups" WHERE "lunch_groups"."user_id" = $1 AND (DATE(created_at) BETWEEN '2022-06-01' AND '2022-08-31')  [["user_id", 87]]

    def same_dep_employee
      User.where.not(id: user.id).where(department_id: user.department_id).pluck(:id)
---
SELECT "users"."id" FROM "users" WHERE "users"."id" != $1 AND "users"."department_id" = $2  [["id", 87], ["department_id", 13]]

    def same_group_users_ids
      LunchGroup.joins(:user)
                .where.not(user_id: user.id)
                .where(group_id: group_ids)
                .pluck(:user_id)
---
SELECT "lunch_groups"."user_id" FROM "lunch_groups" INNER JOIN "users" ON "users"."id" = "lunch_groups"."user_id" WHERE "lunch_groups"."user_id" != $1 AND "lunch_groups"."group_id" IN ($2, $3)  [["user_id", 79], ["group_id", 126], ["group_id", 126]]