app/services/mystery_lunch/delete.rb

    def lunch_group
      @lunch_group ||= LunchGroup.current_month.where(user_id: user.id).first
---
SELECT "lunch_groups".* FROM "lunch_groups" WHERE (DATE(created_at) BETWEEN '2022-09-01' AND '2022-09-30') AND "lunch_groups"."user_id" = $1 ORDER BY "lunch_groups"."id" ASC LIMIT $2  [["user_id", 31], ["LIMIT", 1]]

    def group_full?
      group.lunch_groups.count > 2
---
SELECT COUNT(*) FROM "lunch_groups" WHERE "lunch_groups"."group_id" = $1  [["group_id", 171]]

    def group
      @group ||= lunch_group.group
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 171], ["LIMIT", 1]]

    def alone_member
      group.lunch_groups.where.not(user_id: user.id).first.user
---
SELECT "lunch_groups".* FROM "lunch_groups" WHERE "lunch_groups"."group_id" = $1 AND "lunch_groups"."user_id" != $2 ORDER BY "lunch_groups"."id" ASC LIMIT $3  [["group_id", 171], ["user_id", 31], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]

    def assign_member
      group.delete
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 171]]

    def delete_user
      lunch_group.delete
      user.delete
---
DELETE FROM "lunch_groups" WHERE "lunch_groups"."id" = $1  [["id", 314]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 31]]