app/views/users/_form.html.erb

    <%= f.password_field :password, required: true %><br><br>
    <%= f.select :department_id, Department.all.pluck(['name', 'id']), { prompt: 'Select One', required: true }%>
---
SELECT name, id FROM "departments"