app/views/home/index.html.erb

SELECT "groups".* FROM "groups" WHERE (DATE(created_at) BETWEEN '2022-09-01' AND '2022-09-30')
SELECT "lunch_groups".* FROM "lunch_groups" WHERE "lunch_groups"."group_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16)
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48)
SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
<br>
<% group.lunch_groups.each do |lg| %>
	<%= image_tag(lg.user.file, style: 'height:50px;width:50px;') if lg.user.file.present? %>
	<%= "#{lg.user.first_name} #{lg.user.last_name} - #{lg.user.id} - #{lg.user&.department&.name}" %>