app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49)
SELECT "groups".* FROM "groups" WHERE (DATE(created_at) BETWEEN '2022-09-01' AND '2022-09-30')
---
  def index
    @groups = Group.includes(lunch_groups: :user).where("DATE(created_at) BETWEEN ? AND ?", Date.today.beginning_of_month, Date.today.end_of_month)