app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "Joeyn1"], ["updated_at", "2022-09-03 20:00:01.776943"], ["id", 82]]
---
  def update
    @user = current_user
    respond_to do |format|
      if @user.update(user_params)